"use client";

import {IoIosArrowDown} from "react-icons/io";
import {MdOutlineKeyboardArrowUp} from "react-icons/md";

import {useState} from "react";

const Accordion = ({reverse = false}) => {
  const [isShow, setIsShow] = useState(false);

  const styleReverse = {
    firstDiv: "flex flex-col-reverse",
    contetDiv: " border border-[rgba(0,0,0,0.2)] mx-[1.5rem] rounded-2xl",
    contentDivTrue:
      "max-h-30 [mask-image:linear-gradient(to_top,transparent,black)]",
  };

  return (
    <div
      className={`w-auto bg-[#fff] rounded-lg  md:max-w-[1200px]  m-auto ${
        reverse && styleReverse.firstDiv
      }`}>
      <div
        onClick={() => setIsShow((prev) => !prev)}
        className={`flex  items-center text-sm p-4 rounded-t-lg cursor-pointer ${
          reverse
            ? "justify-center text-[#2196f3] font-bold flex-row-reverse"
            : "justify-between"
        }`}>
        <span className='text-2xl'>
          {isShow ? <MdOutlineKeyboardArrowUp /> : <IoIosArrowDown />}
        </span>

        {reverse ? (
          <h3>مشاهده {isShow ? "کمتر" : "بیشتر"}</h3>
        ) : (
          <h3> درباره لیپک</h3>
        )}
      </div>

      <div
        className={`overflow-hidden transition-all duration-300 ease-in-out ${
          reverse ? styleReverse.contetDiv : ""
        } ${
          isShow
            ? " opacity-100"
            : // if reverse is true, apply the reverse styles In HomePage.js
            reverse
            ? styleReverse.contentDivTrue
            : "max-h-0 opacity-0"
        }`}>
        {!reverse && (
          <p className={`text-sm text-[#36405a]  text-right p-4`}>
            لیپک از سال 1399 فعالیت خود را به صورت تخصصی در زمینه لوازم دیجیتال
            شروع کرد. شعار لیپک یک قدم جلوتر است، به این معنا که لیپک تلاش
            می‌کند تا خدمات خود را نسبت به رقبا با کیفیت بهتری ارائه کند. ارائه
            کالای اصل با گارانتی معتبر، قیمت منصفانه، پردازش و ارسال سریع سفارش،
            بسته‌بندی حرفه‌ای و همراهی با مشتریان در تمام مراحل خرید از طریق
            پشتیبانی پاسخگو و مشتری‌مدار، ارزش‌هایی است که لیپک روی آنها بنا شده
            است. با لیپک تجربه‌ی متفاوتی از خرید اینترنتی در ایران را تجربه
            کنید.
          </p>
        )}

        {reverse && (
          <p className={`text-sm text-[#36405a]  text-right p-4`}>
            فروشگاه اینترنتی لیپک، طیف وسیعی از کالاهای دیجیتال روز دنیا را از
            برند‌های معتبر عرضه می‌کند. خرید محصول از فروشگاه‌های اینترنتی لوازم
            دیجیتال چالش‌هایی به همراه دارد از جمله: صحت اصالت کالا تضمین خدمات
            پشتیبانی تفاوت قیمتی نسبت به بازار سنتی برای رفع این چالش‌ها،
            فروشگاه لیپک از طریق واردات و سایر تامین‌کنندگان اصلی کالا، محصولات
            خود را تامین می‌کند تا بتواند کالاها را به قیمت مناسبی عرضه کند.
            لیپک تمامی محصولات خود را با ضمانت اصالت کالا در اختیار شما قرار
            می‌دهد. فروشگاه اینترنتی لیپک همواره سعی کرده است تا تجربه خریدی
            رضایت‌بخش و مطمئن را به شما ارائه دهد. به همین منظور تیم پشتیبانی
            لیپک در تمامی مراحل خرید و پس از آن، همراه شما خواهد بود. خرید کالای
            دیجیتال موبایل : مجموعه‌ای از جدیدترین مدل‌های موبایل اپل، شیائومی،
            سامسونگ، موتورولا و هوآوی همراه با اطلاعات تخصصی در سایت لیپک قابل
            مشاهده و بررسی است. ویژگی‌های بسیاری مانند ظرفیت حافظه، دوربین و
            باتری در قیمت موبایل تاثیرگذارند. شما می‌توانید برای خرید گوشی مورد
            نظر خود، مشخصات و قیمت‌ آن را در فروشگاه اینترنتی لیپک مشاهده کنید.
            لپ‌تاپ : فروشگاه اینترنتی لیپک مجموعه‌ی کاملی از لپ‌تاپ‌‌های گیمینگ،
            برنامه‌نویسی، گرافیکی، اداری، اقتصادی و دانشجویی را در مدل‌های متنوع
            عرضه می‌کند. برای خرید لپ‌‌تاپ از فروشگاه لیپک، می‌توانید پس از
            بررسی مشخصات و کسب اطلاعات تخصصی از لپ‌تاپ‌های اپل، ایسوس، اچ پی،
            لنوو و مایکروسافت، سفارش خود را ثبت کنید. تبلت : با توجه به صفحه
            نمایش بزرگ و راحتی در جابه‌جایی، تبلت‌ها از نظر کاربری بسیار کارآمد
            هستند. اگر نیاز به خرید تبلت ویندوزی یا اندرویدی دارید، می‌توانید
            مجموعه‌ی کاملی از تبلت‌ها را در برند‌های مختلف مانند مایکروسافت،
            سامسونگ و اپل (آیپد)، همراه با ویژگی‌های دقیق آن‌ها در سایت لیپک
            مشاهده کنید. هندزفری : برای خرید هندزفری ویژگی‌هایی مانند حجم و
            کیفیت صدا، قابلیت کنترل لمسی و عمر باتری اهمیت بالایی دارند. تنوع
            گسترده‌ای از هدفون‌های مطرح مانند هدفون انکر، سونی، جی بی ال،
            شیائومی، کیو سی وای، سامسونگ و اپل را در فروشگاه لیپک مشاهده کنید.
            ساعت هوشمند : ساعت‌های هوشمند امروزه وظایف مهم‌تری از نمایش زمان بر
            عهده دارند. امکاناتی مانند قابلیت مکالمه، ویژگی ضدآب و نمایش اعلان و
            پیام‌ها، بخشی از ویژگی‌های ساعت‌ هوشمند است. شما می‌توانید برند‌های
            معروف ساعت هوشمند مانند اپل، سامسونگ، امیزفیت، شیائومی و کیسلکت را
            همراه با مشخصات و بررسی تخصصی آن در سایت لیپک مشاهده کنید. کنسول
            بازی: بخش مهمی از کاربران لیپک را افراد علاقه‌مند به بازی تشکیل
            می‌دهند. لیپک مجموعه بزرگی از محصولات گیمینگ مانند کنسول بازی Xbox،
            پلی استیشن و لوازم جانبی آن‌ها را در سبد محصولات خود دارد. لوازم
            جانبی لوازم جانبی موبایل و کامپیوتر به دلیل کاربرد فراوان آن‌ها در
            زندگی روزمره ما، اهمیت ویژه‌ای پیدا کرده‌اند. فروشگاه لیپک مجموعه‌ی
            کاملی از لوازم جانبی دیجیتال را در برند‌های مختلف فراهم کرده است تا
            شما را در انتخابی بهتر یاری کند. موس : اگر بازی کامپیوتری انجام
            می‌دهید و یا یک گیمر حرفه‌ای هستید، موس گیمینگ انتخاب بهتری برای
            شماست. موس گیمینگ ویژگی‌های مهمی مانند سرعت IPS، قابلیت شخصی‌سازی
            دکمه‌ها و نورپردازیRGB را دارد. شما می‌توانید برای خرید موس گیمینگ
            از برندهای مطرح بازار مانند لاجیتک، ریزر، میشن، ردراگون و ای‌دیتا در
            سایت لیپک دیدن کنید. هارد اکسترنال : انواع متفاوتی از هارد‌های
            اکسترنال با ظرفیت‌های مختلف و قابلیت‌هایی مانند ضدآب، ضدضربه و ضد
            شوک وجود دارند. هاردها در ابعاد متفاوت و برای کاربری‌های گوناگون
            طراحی شده‎اند. برای خرید هارد اکسترنال می‌توانید از میان برند‌های
            موجود در سایت لیپک مانند هارد ای‌دیتا، سیگیت و وسترن دیجیتال انتخاب
            کنید. شارژر : شارژر گوشی از اصلی‌ترین لوازم جانبی همراه است. شما
            می‌توانید مجموعه‌ای از شارژرهای مختلف از جمله شارژر دیواری و شارژر‌
            فندکی اورجینال را از برندهای معتبر، در سایت لیپک مشاهده کنید.
            پاوربانک : نیاز به شارژ دوباره باتری گوشی کم و بیش برای همه‌ی ما
            وجود دارد. زمان زیادی است که پاوربانک یا شارژر همراه به همین منظور
            مورد استفاده قرار می‌گیرد. پاوربانک‌ها در ظرفیت‌ و برندهای متنوعی
            عرضه می‌شوند. شما می‌توانید مدل‌های‌ جدید پاوربانک فست شارژ،
            سامسونگ، شیائومی، باسئوس، ای‌دیتا و انکر را در سایت لیپک مشاهده
            کنید.
          </p>
        )}
      </div>
    </div>
  );
};

export default Accordion;
